Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [2]:
pd.Series ([4, 8, 15, 16, 23, 42])

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [10]:
my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

my_series = pd.Series(my_list)
print(my_series)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the  data:
Then, print the DataFrame.

In [3]:
data = {'Name' :  ['Alice', 'Bob', 'Claire'],
        'Age' :  [25,30,27],
        'Gender': ['Female','Male','Female']}

In [5]:
data1 = pd.DataFrame(data)

In [8]:
data1

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In pandas, a DataFrame is a two-dimensional labeled data structure that consists of columns, where each column can have a different data type (e.g., integer, float, string). It is one of the primary data structures in pandas and is similar to a table in a relational database.

A Series, on the other hand, is a one-dimensional labeled array that can hold any data type. It represents a single column or a single row of data in a DataFrame.

In [9]:
data = {'Name' :  ['Alice', 'Bob', 'Claire'],
        'Age' :  [25,30,27],
        'Gender': ['Female','Male','Female']}
data1 = pd.DataFrame(data)
data1

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

head() and tail(): These functions allow you to view the first or last few rows of a DataFrame, respectively. They are useful for quickly inspecting the data.

info(): This function provides a summary of the DataFrame, including the data types, non-null counts, and memory usage. It helps in understanding the structure and integrity of the data.

drop(): This function allows removing rows or columns from the DataFrame. It is useful for eliminating unnecessary data.

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Among the options provided (Series, DataFrame, Panel), both Series and DataFrame are mutable in nature, while Panel is not.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [11]:
names = pd.Series(['Alice', 'Bob', 'Charlie'])
ages = pd.Series([25, 30, 35])
genders = pd.Series(['Female', 'Male', 'Female'])

df = pd.DataFrame({'Name': names, 'Age': ages, 'Gender': genders})

In [12]:
df

      Name  Age  Gender
0    Alice   25  Female
1      Bob   30    Male
2  Charlie   35  Female